class InfoList {
  Map<String, String> userInfo = {
    "college": "공과대학",
    "major": "건축학부",
    "year": "2017"
  };

  List<String> collegeList = [
    "인문대학",
    "자연과학대학",
    "법과대학",
    "사회과학대학",
    "경제통상대학",
    "경영대학",
    "공과대학",
    "IT대학",
    "융합특성화자유전공학부",
  ];

  List<String> humanitiesMajorList = [
    "기독교학과",
    "국어국문학과",
    "영어영문학과",
    "독어독문학과",
    "불어불문학과",
    "중어중문학과",
    "일어일문학과",
    "철학과",
    "사학과",
    "예술창작학부",
    "스포츠학부",
  ];
  List<String> naturalSciencesMajorList = [
    "수학과",
    "물리학과",
    "화학과",
    "정보통계보험수리학과",
    "의생명시스템학부",
  ];
  List<String> lawMajorList = ["법학과", "국제법무학과"];
  List<String> socialSciencesMajorList = [
    "사회복지학부",
    "행정학부",
    "정치외교학과",
    "정보사회학과",
    "언론홍보학과",
    "평생교육학과",
  ];
  List<String> economicTradeMajorList = [
    "경제학과",
    "글로벌통상학과",
    "금융경제학과",
    "국제무역학과",
    "통상산업학과",
  ];
  List<String> administrationMajorList = [
    "경영학부",
    "벤처중소기업학과",
    "회계학과",
    "금융학부",
    "벤처경영학과",
    "혁신경영학과",
    "복지경영학과",
    "회계사무학과",
  ];
  List<String> engineeringMajorList = [
    "화학공학과",
    "전기공학부",
    "산업정보시스템공학과",
    "건축학부",
    "유기신소재파이버공학과",
  ];
  List<String> itMajorList = [
    "컴퓨터학부",
    "전자정보공학부",
    "글로벌미디어학부",
    "소프트웨어학부",
    "AI융합학부",
    "미디어경영학과",
  ];
  Map<String, String> recommendBookList = {
    "개인추천 책1": "개인추천 책1 작가",
    "개인추천 책2": "개인추천 책2 작가",
    "개인추천 책3": "개인추천 책3 작가",
    "개인추천 책4": "개인추천 책4 작가",
    "개인추천 책5": "개인추천 책5 작가",
  };
  List<Map<String, String>> yearly2017 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2018 = [
    {
      "서명": "82년생 김지영",
      "소장위치": "5층 문학자료실",
      "저자명": "조남주",
    },
    {
      "서명": "나미야 잡화점의 기적",
      "소장위치": "5층 문학자료실",
      "저자명": "히가시노 게이고",
    },
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
  ];
  List<Map<String, String>> yearly2019 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2020 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2021 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
}
